---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotMakeAnalyticalGeometry
source: html/63dbad6c-e42d-58fe-8ddf-1c9cbf069501.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotMakeAnalyticalGeometry Property

Cannot construct Analytical Geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeAnalyticalGeometry { get; }
```